### Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. 

Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  

[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

### Решение

In [1]:
import pandas as pd
import numpy as np

In [2]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургеньев', 'Чехов', 'Островский']}, 
                       columns=['author_id', 'author_name'])
authors

   author_id author_name
0          1   Тургеньев
1          2       Чехов
2          3  Островский

In [3]:
books = pd.DataFrame({'author_id': [1,1,1,2,2,3,3], 
                      'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                      'price': [450, 300, 350, 500, 450, 370, 290]}, 
                     columns=['author_id', 'book_title', 'price'])
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

### Решение

In [4]:
author_price = pd.merge(authors, books, on = 'author_id', how = 'inner')

In [5]:
author_price

   author_id author_name            book_title  price
0          1   Тургеньев           Отцы и дети    450
1          1   Тургеньев                 Рудин    300
2          1   Тургеньев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

### Решение

In [6]:
top5 = author_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1   Тургеньев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1   Тургеньев  Дворянское гнездо    350

### Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. 

В датафрейме authors_stat должны быть четыре столбца:

author_name, min_price, max_price и mean_price,

в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

### Решение

In [7]:
author_list = author_price.loc[:, 'author_name'].unique()
author_list

array(['Тургеньев', 'Чехов', 'Островский'], dtype=object)

In [8]:
min_price = []
max_price = []
mean_price = []
for aname in author_list:
    min_price.append(author_price.loc[author_price['author_name'] == aname, 'price'].min())
    max_price.append(author_price.loc[author_price['author_name'] == aname, 'price'].max())
    mean_price.append(round(author_price.loc[author_price['author_name'] == aname, 'price'].mean(), 2))

In [9]:
authors_stat = pd.DataFrame({'author_name': author_list, 
                             'min_price': min_price,
                             'max_price': max_price,
                             'mean_price': mean_price}, 
                            columns = ['author_name', 'min_price', 'max_price', 'mean_price'])

In [10]:
authors_stat

  author_name  min_price  max_price  mean_price
0   Тургеньев        300        450      366.67
1       Чехов        450        500      475.00
2  Островский        290        370      330.00

### Задание 5

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:

['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

### Решение

In [11]:
author_price

   author_id author_name            book_title  price
0          1   Тургеньев           Отцы и дети    450
1          1   Тургеньев                 Рудин    300
2          1   Тургеньев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [12]:
author_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
author_price

   author_id author_name            book_title  price    cover
0          1   Тургеньев           Отцы и дети    450  твердая
1          1   Тургеньев                 Рудин    300   мягкая
2          1   Тургеньев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [13]:
author_price.reset_index(inplace=True)

In [14]:
book_info = pd.pivot_table(author_price, values='price', index=['author_name'], 
                           columns = ['cover'], aggfunc=np.sum, fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургеньев       650      450
Чехов             0      950

In [15]:
book_info.to_pickle('book_info.pkl')

In [16]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургеньев       650      450
Чехов             0      950